{"config": {"name": "model_3", "input_layers": [["XT", 0, 0], ["XP", 0, 0]], "layers": [{"name": "XT", "config": {"name": "XT", "batch_input_shape": [null, 393, 24], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "XP", "config": {"name": "XP", "batch_input_shape": [null, 393, 52], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "MT", "config": {"name": "MT", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["XT", 0, 0, {}]]], "class_name": "Masking"}, {"name": "MP", "config": {"name": "MP", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["XP", 0, 0, {}]]], "class_name": "Masking"}, {"name": "MergeX", "config": {"axis": -1, "name": "MergeX", "trainable": true}, "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "gru_3", "config": {"return_state": false, "use_bias": true, "units": 256, "recurrent_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "stateful": false, "kernel_regularizer": null, "name": "gru_3", "dropout": 0.2, "unroll": false, "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null}, "inbound_nodes": [[["MergeX", 0, 0, {}]]], "class_name": "GRU"}, {"name": "gru_4", "config": {"return_state": false, "use_bias": true, "units": 128, "recurrent_constraint": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "stateful": false, "kernel_regularizer": null, "name": "gru_4", "dropout": 0.2, "unroll": false, "activation": "tanh", "bias_regularizer": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "activity_regularizer": null, "return_sequences": true, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "bias_constraint": null}, "inbound_nodes": [[["gru_3", 0, 0, {}]]], "class_name": "GRU"}, {"name": "YT", "config": {"name": "YT", "trainable": true, "layer": {"config": {"units": 24, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "name": "dense_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}}, "inbound_nodes": [[["gru_4", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"name": "YP", "config": {"name": "YP", "trainable": true, "layer": {"config": {"units": 52, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax", "activity_regularizer": null, "name": "dense_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}}, "inbound_nodes": [[["gru_4", 0, 0, {}]]], "class_name": "TimeDistributed"}], "output_layers": [["YT", 0, 0], ["YP", 0, 0]]}, "class_name": "Model", "keras_version": "2.1.4", "backend": "tensorflow"}