{"backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "XT", "config": {"dtype": "float32", "name": "XT", "sparse": false, "batch_input_shape": [null, 393, 24]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "XP", "config": {"dtype": "float32", "name": "XP", "sparse": false, "batch_input_shape": [null, 393, 52]}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "MT", "config": {"name": "MT", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["XT", 0, 0, {}]]], "class_name": "Masking"}, {"name": "MP", "config": {"name": "MP", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["XP", 0, 0, {}]]], "class_name": "Masking"}, {"name": "MergeX", "config": {"name": "MergeX", "trainable": true, "axis": -1}, "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "gru_1", "config": {"name": "gru_1", "recurrent_activation": "hard_sigmoid", "unroll": false, "units": 150, "return_sequences": true, "dropout": 0.2, "trainable": true, "kernel_constraint": null, "return_state": false, "bias_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_dropout": 0.0, "use_bias": true, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "go_backwards": false, "stateful": false, "bias_regularizer": null, "activation": "tanh", "kernel_regularizer": null}, "inbound_nodes": [[["MergeX", 0, 0, {}]]], "class_name": "GRU"}, {"name": "YT", "config": {"name": "YT", "trainable": true, "layer": {"config": {"name": "dense_1", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 24, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}}, "inbound_nodes": [[["gru_1", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"name": "YP", "config": {"name": "YP", "trainable": true, "layer": {"config": {"name": "dense_2", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 52, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}}, "inbound_nodes": [[["gru_1", 0, 0, {}]]], "class_name": "TimeDistributed"}], "input_layers": [["XT", 0, 0], ["XP", 0, 0]], "output_layers": [["YT", 0, 0], ["YP", 0, 0]]}, "keras_version": "2.1.4", "class_name": "Model"}