{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.4", "config": {"name": "model_1", "output_layers": [["YT", 0, 0], ["YP", 0, 0]], "layers": [{"name": "XT", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 397, 21], "name": "XT", "dtype": "float32", "sparse": false}}, {"name": "XP", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 397, 50], "name": "XP", "dtype": "float32", "sparse": false}}, {"name": "MT", "inbound_nodes": [[["XT", 0, 0, {}]]], "class_name": "Masking", "config": {"name": "MT", "trainable": true, "mask_value": 0.0}}, {"name": "MP", "inbound_nodes": [[["XP", 0, 0, {}]]], "class_name": "Masking", "config": {"name": "MP", "trainable": true, "mask_value": 0.0}}, {"name": "MergeX", "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "MergeX", "axis": -1, "trainable": true}}, {"name": "gru_1", "inbound_nodes": [[["MergeX", 0, 0, {}]]], "class_name": "GRU", "config": {"recurrent_dropout": 0.0, "trainable": true, "activation": "tanh", "return_sequences": true, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "use_bias": true, "dropout": 0.2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "gru_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "return_state": false, "recurrent_regularizer": null, "recurrent_constraint": null, "stateful": false, "units": 128, "unroll": false, "activity_regularizer": null, "implementation": 1}}, {"name": "YT", "inbound_nodes": [[["gru_1", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"name": "YT", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activation": "softmax", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 21, "activity_regularizer": null}}}}, {"name": "YP", "inbound_nodes": [[["gru_1", 0, 0, {}]]], "class_name": "TimeDistributed", "config": {"name": "YP", "trainable": true, "layer": {"class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "activation": "softmax", "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activity_regularizer": null}}}}], "input_layers": [["XT", 0, 0], ["XP", 0, 0]]}}