{"keras_version": "2.1.4", "backend": "tensorflow", "config": {"input_layers": [["XT", 0, 0], ["XP", 0, 0]], "output_layers": [["YT", 0, 0], ["YP", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 393, 24], "dtype": "float32", "name": "XT"}, "name": "XT", "class_name": "InputLayer"}, {"inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 393, 52], "dtype": "float32", "name": "XP"}, "name": "XP", "class_name": "InputLayer"}, {"inbound_nodes": [[["XT", 0, 0, {}]]], "config": {"mask_value": 0.0, "trainable": true, "name": "MT"}, "name": "MT", "class_name": "Masking"}, {"inbound_nodes": [[["XP", 0, 0, {}]]], "config": {"mask_value": 0.0, "trainable": true, "name": "MP"}, "name": "MP", "class_name": "Masking"}, {"inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "config": {"trainable": true, "name": "MergeX", "axis": -1}, "name": "MergeX", "class_name": "Concatenate"}, {"inbound_nodes": [[["MergeX", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "stateful": false, "trainable": true, "unroll": false, "dropout": 0.2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "name": "simple_rnn_1", "use_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "return_sequences": true}, "name": "simple_rnn_1", "class_name": "SimpleRNN"}, {"inbound_nodes": [[["simple_rnn_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_constraint": null, "activation": "tanh", "kernel_regularizer": null, "stateful": false, "trainable": true, "unroll": false, "dropout": 0.2, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "name": "simple_rnn_2", "use_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "recurrent_constraint": null, "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "return_sequences": true}, "name": "simple_rnn_2", "class_name": "SimpleRNN"}, {"inbound_nodes": [[["simple_rnn_2", 0, 0, {}]]], "config": {"trainable": true, "name": "YT", "layer": {"config": {"bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_3", "kernel_regularizer": null, "activation": "softmax", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}}, "name": "YT", "class_name": "TimeDistributed"}, {"inbound_nodes": [[["simple_rnn_2", 0, 0, {}]]], "config": {"trainable": true, "name": "YP", "layer": {"config": {"bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "name": "dense_4", "kernel_regularizer": null, "activation": "softmax", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 52, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}}, "name": "YP", "class_name": "TimeDistributed"}], "name": "model_2"}, "class_name": "Model"}