{"keras_version": "2.1.4", "backend": "tensorflow", "config": {"name": "model_2", "output_layers": [["YT", 0, 0], ["YP", 0, 0]], "layers": [{"name": "XT", "inbound_nodes": [], "config": {"batch_input_shape": [null, 393, 24], "dtype": "float32", "sparse": false, "name": "XT"}, "class_name": "InputLayer"}, {"name": "XP", "inbound_nodes": [], "config": {"batch_input_shape": [null, 393, 52], "dtype": "float32", "sparse": false, "name": "XP"}, "class_name": "InputLayer"}, {"name": "MT", "inbound_nodes": [[["XT", 0, 0, {}]]], "config": {"name": "MT", "mask_value": 0.0, "trainable": true}, "class_name": "Masking"}, {"name": "MP", "inbound_nodes": [[["XP", 0, 0, {}]]], "config": {"name": "MP", "mask_value": 0.0, "trainable": true}, "class_name": "Masking"}, {"name": "MergeX", "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "config": {"name": "MergeX", "axis": -1, "trainable": true}, "class_name": "Concatenate"}, {"name": "simple_rnn_1", "inbound_nodes": [[["MergeX", 0, 0, {}]]], "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "simple_rnn_1", "return_state": false, "unroll": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dropout": 0.2, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "return_sequences": true, "stateful": false, "activation": "tanh", "kernel_constraint": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 128, "go_backwards": false, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null}, "class_name": "SimpleRNN"}, {"name": "YT", "inbound_nodes": [[["simple_rnn_1", 0, 0, {}]]], "config": {"name": "YT", "trainable": true, "layer": {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_3", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 24, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"name": "YP", "inbound_nodes": [[["simple_rnn_1", 0, 0, {}]]], "config": {"name": "YP", "trainable": true, "layer": {"config": {"kernel_constraint": null, "kernel_regularizer": null, "name": "dense_4", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 52, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "input_layers": [["XT", 0, 0], ["XP", 0, 0]]}, "class_name": "Model"}