{"class_name": "Model", "config": {"input_layers": [["XT", 0, 0], ["XP", 0, 0]], "name": "model_2", "output_layers": [["YT", 0, 0], ["YP", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 388, 28], "name": "XT"}, "name": "XT"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 388, 52], "name": "XP"}, "name": "XP"}, {"class_name": "Masking", "inbound_nodes": [[["XT", 0, 0, {}]]], "config": {"trainable": true, "mask_value": 0.0, "name": "MT"}, "name": "MT"}, {"class_name": "Masking", "inbound_nodes": [[["XP", 0, 0, {}]]], "config": {"trainable": true, "mask_value": 0.0, "name": "MP"}, "name": "MP"}, {"class_name": "Concatenate", "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "config": {"trainable": true, "name": "MergeX", "axis": -1}, "name": "MergeX"}, {"class_name": "SimpleRNN", "inbound_nodes": [[["MergeX", 0, 0, {}]]], "config": {"bias_constraint": null, "stateful": false, "go_backwards": false, "return_state": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "simple_rnn_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 128, "activation": "tanh", "recurrent_constraint": null, "use_bias": true, "unroll": false}, "name": "simple_rnn_1"}, {"class_name": "SimpleRNN", "inbound_nodes": [[["simple_rnn_1", 0, 0, {}]]], "config": {"bias_constraint": null, "stateful": false, "go_backwards": false, "return_state": false, "recurrent_dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "simple_rnn_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "return_sequences": true, "recurrent_regularizer": null, "units": 256, "activation": "tanh", "recurrent_constraint": null, "use_bias": true, "unroll": false}, "name": "simple_rnn_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["simple_rnn_2", 0, 0, {}]]], "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "units": 28, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_3"}}, "name": "YT"}, "name": "YT"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["simple_rnn_2", 0, 0, {}]]], "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "units": 52, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "dense_4"}}, "name": "YP"}, "name": "YP"}]}, "keras_version": "2.1.4", "backend": "tensorflow"}