{"config": {"input_layers": [["XT", 0, 0], ["XP", 0, 0]], "name": "model_4", "layers": [{"name": "XT", "config": {"name": "XT", "batch_input_shape": [null, 393, 24], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "XP", "config": {"name": "XP", "batch_input_shape": [null, 393, 52], "dtype": "float32", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "MT", "config": {"name": "MT", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["XT", 0, 0, {}]]], "class_name": "Masking"}, {"name": "MP", "config": {"name": "MP", "trainable": true, "mask_value": 0.0}, "inbound_nodes": [[["XP", 0, 0, {}]]], "class_name": "Masking"}, {"name": "MergeX", "config": {"name": "MergeX", "trainable": true, "axis": -1}, "inbound_nodes": [[["MT", 0, 0, {}], ["MP", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "simple_rnn_5", "config": {"recurrent_regularizer": null, "dropout": 0.2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "name": "simple_rnn_5", "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 128, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "return_state": false, "kernel_constraint": null, "return_sequences": true, "unroll": false, "stateful": false}, "inbound_nodes": [[["MergeX", 0, 0, {}]]], "class_name": "SimpleRNN"}, {"name": "simple_rnn_6", "config": {"recurrent_regularizer": null, "dropout": 0.2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "name": "simple_rnn_6", "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 256, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "return_state": false, "kernel_constraint": null, "return_sequences": true, "unroll": false, "stateful": false}, "inbound_nodes": [[["simple_rnn_5", 0, 0, {}]]], "class_name": "SimpleRNN"}, {"name": "simple_rnn_7", "config": {"recurrent_regularizer": null, "dropout": 0.2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "name": "simple_rnn_7", "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 64, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "return_state": false, "kernel_constraint": null, "return_sequences": true, "unroll": false, "stateful": false}, "inbound_nodes": [[["simple_rnn_6", 0, 0, {}]]], "class_name": "SimpleRNN"}, {"name": "simple_rnn_8", "config": {"recurrent_regularizer": null, "dropout": 0.2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "name": "simple_rnn_8", "activity_regularizer": null, "kernel_regularizer": null, "activation": "tanh", "go_backwards": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_constraint": null, "units": 128, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "trainable": true, "return_state": false, "kernel_constraint": null, "return_sequences": true, "unroll": false, "stateful": false}, "inbound_nodes": [[["simple_rnn_6", 0, 0, {}]]], "class_name": "SimpleRNN"}, {"name": "YT", "config": {"name": "YT", "trainable": true, "layer": {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_7", "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 24, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}}, "inbound_nodes": [[["simple_rnn_7", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"name": "YP", "config": {"name": "YP", "trainable": true, "layer": {"config": {"trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_8", "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 52, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense"}}, "inbound_nodes": [[["simple_rnn_8", 0, 0, {}]]], "class_name": "TimeDistributed"}], "output_layers": [["YT", 0, 0], ["YP", 0, 0]]}, "keras_version": "2.1.4", "class_name": "Model", "backend": "tensorflow"}